In [1]:
import numpy as np
import pandas as pd
heroes_information = pd.read_csv("heroes_information.csv")
from pandasql import *

In [2]:
####para enlistar los documentos en el directorio#####
os.listdir()

['.ipynb_checkpoints', 'heroes_information.csv', 'SQL Competition.ipynb']

In [3]:
pysqldf = lambda q: sqldf(q,globals())

In [4]:
#Cuál es el nombre del primer superhéroe de la tabla heroes?
query1 = """
SELECT name
FROM heroes_information
where ID = 0;

"""
pysqldf(query1)

     name
0  A-Bomb

In [5]:
#Cuántas casas publicadoras existen?
query2 = """
SELECT count(DISTINCT publisher)
FROM heroes_information;

"""
pysqldf(query2)

   count(DISTINCT publisher)
0                         24

In [9]:
#Cuántos superhéroes miden más de 2 metros (200 cms)
query3 = """
SELECT count(*)
FROM heroes_information
WHERE height > 200;

"""
pysqldf(query3)

   count(*)
0        59

In [8]:
#Cuántos superhéroes son humanos y miden más de 2 metros (200 cms)?
query4 = """
SELECT count(*)
FROM heroes_information
WHERE height > 200
AND upper(race) = 'HUMAN';

"""
pysqldf(query4)

   count(*)
0        12

In [11]:
#Cuántos superhéroes pesan más de 100 lbs y menos de 200 lbs?
query5 = """
SELECT count(*)
FROM heroes_information
WHERE weight BETWEEN 100 AND 200;

"""
pysqldf(query5)

   count(*)
0        98

In [13]:
#Cuántos superhéroes tienen los ojos de color azul o rojo?
query6 = """
SELECT count(*)
FROM heroes_information
WHERE upper("eye color") = 'BLUE'
OR upper("eye color") = 'RED';

"""
pysqldf(query6)

   count(*)
0       271

In [15]:
#Cuántos superhéroes son Human, Mutant y tienen el pelo color Verde o son Vampiros con pelo Negro?
query7 = """
SELECT count(*)
FROM heroes_information
WHERE upper(Race) in ('HUMAN', 'MUTANT') 
AND upper("Hair color") = 'GREEN'
OR upper(Race) = 'VAMPARE' 
AND upper("Hair color") = 'BLACK';

"""
pysqldf(query7)

   count(*)
0         4

In [16]:
#Cuál es el nombre del primer superhéroe si ordeno la tabla por raza en orden descendente?
query8 = """
SELECT name
FROM heroes_information
ORDER BY race DESC LIMIT 1;

"""
pysqldf(query8)

             name
0  Solomon Grundy

In [17]:
#Cuántos superhéroes son de género masculino y cuántas de género femenino?
query9 = """
SELECT gender, count(*)
FROM heroes_information
GROUP BY gender;

"""
pysqldf(query9)

   Gender  count(*)
0    None        29
1  Female       200
2    Male       505

In [19]:
#Cuántas casas publicadoras tienen más de 15 superhéroes?
query10 = """
SELECT publisher, count(*)
FROM heroes_information
GROUP BY publisher
HAVING count(*) > 15;

"""
pysqldf(query10)

           Publisher  count(*)
0          DC Comics       215
1  Dark Horse Comics        18
2      Marvel Comics       388
3       NBC - Heroes        19